app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores"
---
  def index
    @scores = Score.all

INSERT INTO "scores" ("subject", "point", "grade", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "cal"], ["point", 80], ["grade", "A"], ["student_id", 1], ["created_at", "2022-09-22 07:27:07.696028"], ["updated_at", "2022-09-22 07:27:07.696028"]]
---
  def create
    @score = Score.new(score_params)

    respond_to do |format|
      if @score.save

SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_score
      @score = Score.find(params[:id])