app/controllers/students_controller.rb

INSERT INTO "students" ("name", "dob", "student_no", "class_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Nid"], ["dob", "2022-09-22"], ["student_no", "1"], ["class_year", 3], ["created_at", "2022-09-22 07:26:01.275251"], ["updated_at", "2022-09-22 07:26:01.275251"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save